app/views/students/edit.html.erb

SELECT "schools".* FROM "schools" ORDER BY "schools"."name" ASC
---
<h3>School Name</h3>
<%= f.select :school_id, options_for_select(@schools.order(:name).collect { | school | ["#{school.name}" , school.id]}), {prompt: "School..."}, required: true%>