app/views/call_logs/edit.html.erb

  <h3>Prize type</h3>
    <%= f.select :prize_type, options_for_select(School.all.order(:name).collect { | school | ["#{school.name}" , school.id]}), {prompt: "School..."} %>
---
SELECT "schools".* FROM "schools" ORDER BY "schools"."name" ASC