app/views/call_logs/edit.html.erb

  <% end %>
  <% if @student.call_logs.exists?(prize_given: true) %>
---
SELECT  "call_logs".* FROM "call_logs" WHERE "call_logs"."student_id" = ? AND "call_logs"."prize_given" = ? ORDER BY "call_logs"."id" ASC LIMIT ?  [["student_id", 3], ["prize_given", true], ["LIMIT", 1]]
SELECT  1 AS one FROM "call_logs" WHERE "call_logs"."student_id" = ? AND "call_logs"."prize_given" = ? LIMIT ?  [["student_id", 1], ["prize_given", true], ["LIMIT", 1]]

  <h3>Prize type</h3>
    <%= f.select :prize_type, options_for_select(["School Material", "Fun Toy", "Something else"]) %>
---
SELECT "schools".* FROM "schools"