app/views/call_logs/new.html.erb

SELECT  "students".* FROM "students" ORDER BY "students"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "students"
---
      $('.button').attr('disabled','disabled');
      $('.input').change(function() {
        var value = $('.input').val().toUpperCase();
        if ((<% if Student.count == 0 %>false<% else %><% Student.all.each do |student| %>value == "<%= student.codename %>" <% if student.id + 1 > Student.last.id %><% else %>|| <% end %><% end %><% end %>) && value != ""){
          $('.button').removeAttr('disabled');
          $('.error').hide();
          $('.input').css("border", "none");
        }
        else {
          $('.input').css("border", "#ff4d4d 2px solid");
          $('.error').show();
          $('.button').attr('disabled','disabled');
        }
        $('.link').click(function() {
          $('form').submit();
        });
      });