app/views/home/devstats.html.erb

SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
SELECT COUNT(*) FROM "schools"
SELECT COUNT(*) FROM "image_shares"
---
<h3>DATABASE</h3>
<h1 class="total"><%= User.all.size + TimeClock.all.size + Student.all.size + Search.all.size + School.all.size + Principal.all.size + MnpsReport.all.size + CallLog.all.size %></h1>
<hr width="70%">
<%= pie_chart [["Users",User.all.size],["Timesheets",TimeClock.all.size],["Students",Student.all.size],["Schools",School.all.size],["Searches",Search.all.size],["Principals",Principal.all.size],["Reports",MnpsReport.all.size],["Call Logs",@calllogs.count], ["Images", ImageShare.all.size]], legend: false, colors: ["#b9e3f8","#8bd1f4","#5dbeef", "#2eacea", "#1592d1", "#1072a2", "#0b5174", "#073045", "#021017"], width: "200px", id: "piedb" %>