app/views/home/employees.html.erb

  <div class="formparent">
  <% if TimeClock.all.where.not(clock_out: nil, billed: true).present? %>
---
SELECT "time_clocks".* FROM "time_clocks" WHERE ("time_clocks"."clock_out" IS NOT NULL) AND ("time_clocks"."billed" != ?)  [["billed", true]]