app/views/home/statistics.html.erb

        <script type="text/javascript">
    $(document).ready(function(){
      setTimeout(function() {
      google.charts.load('current', {
      'callback': function () {
        drawCount();
        drawHours();
        drawSubject();
      },
      'packages': ['corechart'],
    });
    }, 3000);

      function drawCount() {
        var data = google.visualization.arrayToDataTable([
          ['Date', 'Calls'],
          <% ((28.days.ago - 5.hours).beginning_of_day.to_date..(1.day.ago - 5.hours).to_date).each do |date| %>
          <% unless date.on_weekend? || date.friday? %>
            ['<%= date.strftime('%B %d, %Y') %>',<%= CallLog.where(date: date).size %>],
          <% end %>
          <% end %>
          <% unless Date.today.on_weekend? || Date.today.friday? %>
---
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', created_at) AS strftime_y_m_d_00_00_00_utc_created_at FROM "call_logs" WHERE (created_at >= '2017-06-15 06:41:41.711075' AND created_at <= '2017-07-13 06:41:41.711256') GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', created_at)