app/views/home/timesheets.html.erb

SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ?  [["user_id", 1]]
---
	<h1><%= user.firstname%>:</h1>
	<% user.time_clocks.each do |time| %>