app/views/mnps_reports/all_reports.html.erb

<% @totalhours = 0 %>
<% @user.time_clocks.where.not(billed: false).each do |total| %>
---
SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."mnps_report_id" = ?  [["mnps_report_id", 1]]

  </tr>
  <% @user.mnps_reports.where.not(var: -1).each do |report| %>
---
SELECT "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."user_id" = ?  [["user_id", 1]]

</div>
<% if User.find_by_id(@user.id + 1) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]