app/views/mnps_reports/all_reports.html.erb

SELECT  "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."mnps_report_id" = ? AND "time_clocks"."date" = ? LIMIT ?  [["mnps_report_id", 2], ["date", 2017], ["LIMIT", 1]]
---
  </tr>
  <% @user.time_clocks.where.not(clock_out: nil).order('date').each do |timesheet| %>