app/views/mnps_reports/show.html.erb

  </tr>
  <% @user.mnps_reports.each do |metareport| %>
  <% metareport.time_clocks.each do |report| %>
---
SELECT "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."user_id" = ?  [["user_id", 1]]
SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."mnps_report_id" = ?  [["mnps_report_id", 2]]