app/views/user/show.html.erb

SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ? ORDER BY date DESC  [["user_id", 1]]
---
  <tbody>
    <% @user.time_clocks.order('date DESC').each do |time| %>