app/views/user/show.html.erb

SELECT  1 AS one FROM "mnps_reports" WHERE "mnps_reports"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."user_id" = ?  [["user_id", 1]]
---
<h3>Other Reports for this Employee</h3>
<% if @user.mnps_reports.exists? %>