app/views/searches/_form.html.erb

 <% elsif @search.model == "Student" %>
    <% @schools = School.all %>
---
SELECT "schools".* FROM "schools"