app/views/searches/show.html.erb


<% if @search.model == "MnpsReport" || @search.model == "Prize" || @model.exists?("#{@param}": @search.search)%>
  <% if @search.model == "MnpsReport" %>
  <% @results = User.where(role: @search.search) %>
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "0"]]

  </tr>
  <% @user.mnps_reports.where.not(var: -1).each do |report| %>
---
SELECT "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."user_id" = ?  [["user_id", 3]]

    <% @results.each do |result| %>
      <% @count = Student.all.where(school_id: result.id).count %>
---
SELECT COUNT(*) FROM "students" WHERE "students"."school_id" = ?  [["school_id", 1]]