app/controllers/call_logs_controller.rb

  def index
    @call_logs = CallLog.all
---
SELECT "call_logs".* FROM "call_logs"

  def edit
    @call_log = CallLog.find(params[:id])
    @students = Student.all
    @schools = School.all
    @student = @call_log.student
    @school = School.find_by_id(@student.school_id)
---
SELECT  "call_logs".* FROM "call_logs" WHERE "call_logs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students"
SELECT "schools".* FROM "schools"
SELECT  "students".* FROM "students" WHERE "students"."id" = ? ORDER BY "students"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @call_log = CallLog.new(call_log_params)
    @students = Student.all
    @schools = School.all
    @call_log.codename = @call_log.codename.upcase
    unless Student.exists?(codename: @call_log.codename)
    @student = Student.new(codename: @call_log.codename)
    @student.save!
  end
        @students.where(codename: @call_log.codename.upcase).each do |student|
      @call_log.student_id = student.id
      @call_log.save!
    end
    respond_to do |format|
      if @call_log.save
        if Student.where(codename: @call_log.codename).last.school_id.nil?
        format.html { redirect_to edit_student_path(@call_log.student_id), notice: 'Please create a student' }
        else
        format.html { redirect_to edit_call_log_path(@call_log), notice: 'Call log was successfully created.' }
      end
        format.json { render :show, status: :created, location: @call_log }
      else
        format.html { render :new }
        format.json { render json: @call_log.errors, status: :unprocessable_entity }
      end
    @call_log.entered_by = "#{@call_log.user.firstname} #{@call_log.user.lastname}"
    @call_log.save!
    end
    @call_log.starttime = DateTime.now.strftime("%k:%M:%S")
    @call_log.save!
    ActionCable.server.broadcast "active_log_channel",{activelogs: CallLog.all.where(endtime: nil).count}
    ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size, images: ImageShare.all.size}
---
SELECT  "students".* FROM "students" WHERE "students"."codename" = ? ORDER BY "students"."id" DESC LIMIT ?  [["codename", "HH1234"], ["LIMIT", 1]]
SELECT  1 AS one FROM "students" WHERE "students"."codename" = ? LIMIT ?  [["codename", "HH1234"], ["LIMIT", 1]]
INSERT INTO "call_logs" ("date", "user_id", "codename", "created_at", "updated_at", "student_id") VALUES (?, ?, ?, ?, ?, ?)  [["date", Sun, 09 Jul 2017], ["user_id", 1], ["codename", "HH1234"], ["created_at", 2017-07-10 02:54:17 UTC], ["updated_at", 2017-07-10 02:54:17 UTC], ["student_id", 1]]
INSERT INTO "students" ("codename", "created_at", "updated_at") VALUES (?, ?, ?)  [["codename", "HH1234"], ["created_at", 2017-07-10 02:54:17 UTC], ["updated_at", 2017-07-10 02:54:17 UTC]]
UPDATE "call_logs" SET "starttime" = ?, "updated_at" = ? WHERE "call_logs"."id" = ?  [["starttime", 2000-01-01 21:54:17 UTC], ["updated_at", 2017-07-10 02:54:17 UTC], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "call_logs" WHERE "call_logs"."endtime" IS NULL
SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "image_shares"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"

  def update
    @student = @call_log.student
    respond_to do |format|
      if @call_log.update(call_log_params)
        format.html { redirect_to root_path, notice: 'Call log was successfully updated.' }
        format.json { render :show, status: :ok, location: @call_log }
        format.js
      else
        format.html { render :edit }
        format.json { render json: @call_log.errors, status: :unprocessable_entity }
      end
    end
      @call_log.endtime = DateTime.now.strftime("%k:%M:%S")
      @call_log.save!
      @call_log.duration = time_diff(@call_log.starttime, @call_log.endtime).to_d
      @call_log.save!
  ActionCable.server.broadcast "stats_channel", {
    sessions: CallLog.where.not(duration: nil).where('date BETWEEN ? AND ?', 28.days.ago.beginning_of_day, Date.today.end_of_day).size,
    prevsessions: CallLog.where.not(duration: nil).where('date BETWEEN ? AND ?', 56.days.ago.beginning_of_day, 28.days.ago.end_of_day).size,
    sessiongraph: CallLog.where.not(duration: nil).where('date BETWEEN ? AND ?', 28.days.ago.beginning_of_day, Date.today.end_of_day)
  }
  ActionCable.server.broadcast "active_log_channel",{activelogs: CallLog.all.where(endtime: nil).count}
---
UPDATE "call_logs" SET "worksheet" = ?, "stoodle" = ?, "image_share" = ?, "textbook" = ?, "notes" = ?, "skill" = ?, "startknow" = ?, "endknow" = ?, "parent" = ?, "lang" = ?, "teacher_name" = ?, "prize_type" = ?, "name" = ?, "referral_prize" = ?, "prize_given" = ?, "updated_at" = ? WHERE "call_logs"."id" = ?
SELECT COUNT(*) FROM "call_logs" WHERE "call_logs"."endtime" IS NULL

  def destroy
    @call_log.destroy
    respond_to do |format|
      format.html { redirect_to call_logs_url, notice: 'Call log was successfully destroyed.' }
      format.json { head :no_content }
    end
    ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size}
---
DELETE FROM "call_logs" WHERE "call_logs"."id" = ?  [["id", 980190962]]
SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
SELECT COUNT(*) FROM "schools"

    def set_call_log
      @call_log = CallLog.find(params[:id])
---
SELECT  "call_logs".* FROM "call_logs" WHERE "call_logs"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]