app/controllers/home_controller.rb

  def timesheets
    unless current_user.administrator?
      redirect_to root_path
    end
    @users = User.all
---
SELECT "users".* FROM "users"

  def index
    @users = User.all
    unless current_user.administrator? || current_user.developer?
      redirect_to time_clocks_path
    end
    if current_user.developer?
      @calllogs = CallLog.all
    @activecalls = @calllogs.where(endtime: nil).count
    @onlineusers = @users.joins(:time_clocks).where(time_clocks: {clock_out: nil}).count
  end
    @search = Search.new
    @mnps_report = MnpsReport.new
    if current_user.administrator? && current_user.district != "null"
      @user = User.where(id: current_user.district).first
---
SELECT COUNT(*) FROM "call_logs" WHERE "call_logs"."endtime" IS NULL
SELECT COUNT(*) FROM "users" INNER JOIN "time_clocks" ON "time_clocks"."user_id" = "users"."id" WHERE "time_clocks"."clock_out" IS NULL
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]