app/controllers/home_controller.rb

  def statistics
    unless current_user.administrator? || current_user.specialist?
      redirect_to root_path
    end
    @sessions = 0
    @prevsessions = 0
    @images = 0
    @previmages = 0
    @stoodle = 0
    @prevstoodle = 0
    @complete = 0
    @prevcomplete = 0
    @master = 0
    @prevmaster = 0
    @sessions = CallLog.where.not(duration: nil).where('date BETWEEN ? AND ?', 28.days.ago.beginning_of_day, Date.today.end_of_day).size
---
SELECT "call_logs".* FROM "call_logs" WHERE ("call_logs"."duration" IS NOT NULL) AND (created_at BETWEEN '2017-06-15 06:41:41.570591' AND '2017-07-13')
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', created_at) AS strftime_y_m_d_00_00_00_utc_created_at FROM "call_logs" WHERE (created_at >= '2017-06-15 06:41:41.711075' AND created_at <= '2017-07-13 06:41:41.711256') GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', created_at)

  def employees
    @users = User.all
---
SELECT "users".* FROM "users" ORDER BY role DESC

  def devstats
    @users = User.all
    unless current_user.specialist?
      redirect_to root_path
    end
    if current_user.specialist?
      @calllogs = CallLog.all
    @activecalls = @calllogs.where(endtime: nil).size
    @onlineusers = @users.joins(:time_clocks).where(time_clocks: {clock_out: nil}).size
---
SELECT COUNT(*) FROM "call_logs" WHERE "call_logs"."endtime" IS NULL
SELECT COUNT(*) FROM "users" INNER JOIN "time_clocks" ON "time_clocks"."user_id" = "users"."id" WHERE "time_clocks"."clock_out" IS NULL

    def genschools
      sql = (['INSERT INTO "schools" ("name", "address", "city", "state", "zip", "sizey", "phone", "principal", "principalemail",
                       "sonic", "peds", "census", "ptgs", "appalreg", "titlei", "sbdistrict", "ccdistrict", "created_at",
                   "updated_at") VALUES ("Trousdale sizey Elementary School","115 Lock Six Road ","Hartsville","TN",37074,"Test","615-374-3752","Demetrice Badru","demetricebadru@tcschools.org",0,79,600,90,0,0,1,1,"2017-07-13 10:42:35","2017-07-13 10:42:35")',
'INSERT INTO "schools" ("name", "address", "city", "state", "zip", "sizey", "phone", "principal", "principalemail",
                       "sonic", "peds", "census", "ptgs", "appalreg", "titlei", "sbdistrict", "ccdistrict", "created_at",
                   "updated_at") VALUES ("Jim Satterfield Middles School","110 Damascus Street","Hartsville","TN",37074,"Test","615-374-2748","JBrim McCall","jmccall@tcschools.org ",0,46,300,0,0,0,1,1,"2017-07-13 10:42:35","2017-07-13 10:42:35")',
'INSERT INTO "schools" ("name", "address", "city", "state", "zip", "sizey", "phone", "principal", "principalemail",
                       "sonic", "peds", "census", "ptgs", "appalreg", "titlei", "sbdistrict", "ccdistrict", "created_at",
                   "updated_at") VALUES ("Trousdale sizey High School","262 W McMurry Blvd","Hartsville","TN",37074,"Test","615-374-2201","Teresa Dickerson","teresadickerson@tcschools.org",0,46,400,0,0,0,1,1,"2017-07-13 10:42:35","2017-07-13 10:42:35")'])
      sql.each do |osql|
        ActiveRecord::Base.connection.execute(osql.to_s)
      end
      ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size}
---
SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
SELECT COUNT(*) FROM "schools"