app/controllers/mnps_reports_controller.rb

SELECT "mnps_reports".* FROM "mnps_reports" INNER JOIN "users" ON "users"."id" = "mnps_reports"."user_id" WHERE "mnps_reports"."var" = ? AND "mnps_reports"."billdate" = ? AND ("users"."role" != ?)  [["var", 1], ["billdate", Wed, 12 Jul 2017], ["role", :admin]]
---
  def all_reports
    @mnps_report = MnpsReport.find(params[:id])
    @mnps_reports = MnpsReport.where(var: @mnps_report.id, billdate: @mnps_report.billdate).joins(:user).where.not(users: {role: :admin})

UPDATE "time_clocks" SET "mnps_report_id" = ?, "billed" = ?, "updated_at" = ? WHERE "time_clocks"."id" = ?  [["mnps_report_id", 3], ["billed", true], ["updated_at", 2017-07-13 04:55:09 UTC], ["id", 16]]
---
  def create
    @mnps_report = MnpsReport.new(mnps_report_params)
    @user = @mnps_report.user
    respond_to do |format|
      if @mnps_report.save && !@user.administrator?
        @user.time_clocks.where(billed: false).each do |time|
          time.mnps_report_id = @mnps_report.id
          time.billed = true
          time.save!
        end
        format.html { redirect_to mnps_report_path(@mnps_report, format: 'pdf'), notice: 'Mnps report was successfully created.' }
        format.json { render :show, status: :created, location: @mnps_report }
      elsif @mnps_report.save && @user.administrator?