app/controllers/mnps_reports_controller.rb

  def show
    @user = @mnps_report.user
    @timeclocks = @mnps_report.time_clocks
    @thisyear = Date.today.strftime("%Y").to_i
    @yearwork = @timeclocks.find_by_date(@thisyear)
    @totalhours = 0
    @user.mnps_reports.each do |report|
---
SELECT  "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."mnps_report_id" = ? AND "time_clocks"."date" = ? LIMIT ?  [["mnps_report_id", 2], ["date", 2017], ["LIMIT", 1]]
SELECT "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."user_id" = ?  [["user_id", 1]]

  def all_reports
    @mnps_report = MnpsReport.find(params[:id])
    @mnps_reports = MnpsReport.where(var: @mnps_report.id, billdate: @mnps_report.billdate)
---
SELECT  "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."var" = ? AND "mnps_reports"."billdate" = ?  [["var", 22], ["billdate", Mon, 17 Jul 2017]]

  def create
    @mnps_report = MnpsReport.new(mnps_report_params)
    @user = @mnps_report.user
    respond_to do |format|
      if @mnps_report.save
        @users = User.includes(:time_clocks).where.not(:time_clocks => {clock_out: nil})
        @unpaid_hours = 0
        @users.each do |user|
          user.time_clocks.where(billed: false).each do |time|
            @unpaid_hours += time.hours
          end
          MnpsReport.create(user_id: user.id, billdate: Date.today, var: @mnps_report.id, hours: @unpaid_hours)
          user.time_clocks.where(billed: false).each do |time|
            time.mnps_report_id = user.mnps_reports.last.id
            time.billed = true
            time.save!
            @unpaid_hours = 0
          end
        end
        format.html { redirect_to all_mnps_reports_path(@mnps_report, format: 'pdf'), notice: 'Mnps report was successfully created.' }
        format.json { render :show, status: :created, location: @mnps_report }
      else
        format.html { render :new }
        format.json { render json: @mnps_report.errors, status: :unprocessable_entity }
      end
    end
    ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size}
---
INSERT INTO "mnps_reports" ("hours", "billdate", "user_id", "created_at", "updated_at", "var") VALUES (?, ?, ?, ?, ?, ?)  [["hours", #<BigDecimal:7ff2591697b8,'0.0',9(18)>], ["billdate", Wed, 12 Jul 2017], ["user_id", 1], ["created_at", 2017-07-13 04:55:09 UTC], ["updated_at", 2017-07-13 04:55:09 UTC], ["var", 1]]
SELECT "users".* FROM "users" INNER JOIN "time_clocks" ON "time_clocks"."user_id" = "users"."id" WHERE ("time_clocks"."clock_out" IS NOT NULL)
SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ? AND "time_clocks"."billed" = ?  [["user_id", 1], ["billed", false]]
SELECT  "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."user_id" = ? ORDER BY "mnps_reports"."id" DESC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
SELECT COUNT(*) FROM "schools"

    def set_mnps_report
      @mnps_report = MnpsReport.find(params[:id])
---
SELECT  "mnps_reports".* FROM "mnps_reports" WHERE "mnps_reports"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]