app/controllers/principals_controller.rb

SELECT  "principals".* FROM "principals" WHERE "principals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @principal = Principal.find(params[:id])

SELECT  "principals".* FROM "principals" WHERE "principals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def sendmail
    @principal = Principal.find(params[:id])

SELECT  "principals".* FROM "principals" WHERE "principals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def dlnab
    unless current_user && current_user.administrator?
      redirect_to root_path
    else
    @principal = Principal.find(params[:id])

INSERT INTO "principals" ("ccontactfirst", "ccontactlast", "ccontacttitle", "schoolsystem", "mailaddress", "csz", "phonenumb", "email", "textcontactfirst", "textcontactlast", "textcontactemail", "completedbyfirst", "completedbylast", "completedbytitle", "created_at", "updated_at", "nab_filename", "nab_content_type", "nab_contents", "snl_filename", "snl_content_type", "snl_contents", "city", "zip", "d1", "d2", "d3", "c1", "c2", "c3", "nice_name", "nice_type", "nice_content", "mone", "mtwo", "de1", "de2", "de3") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @principal = Principal.new(principal_params)

    respond_to do |format|
      if @principal.save

DELETE FROM "principals" WHERE "principals"."id" = ?  [["id", 980190962]]
SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
SELECT COUNT(*) FROM "schools"
---
  def destroy
    @principal.destroy
    respond_to do |format|
      format.html { redirect_to principals_url, notice: 'Principal was successfully destroyed.' }
      format.json { head :no_content }
    end
    ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size}

SELECT  "principals".* FROM "principals" WHERE "principals"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_principal
      @principal = Principal.find(params[:id])