app/controllers/schools_controller.rb

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
        format.html { redirect_to schools_path, notice: 'School was successfully created.' }
        format.json { render :show, status: :created, location: @school }
      else
        format.html { render :new }
        format.json { render json: @school.errors, status: :unprocessable_entity }
      end
    end
    ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size}
---
INSERT INTO "schools" ("name", "address", "city", "state", "zip", "county", "phone", "principal", "principalemail", "sonic", "peds", "census", "ptgs", "appalreg", "titlei", "sbdistrict", "ccdistrict", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
SELECT COUNT(*) FROM "schools"