app/controllers/searches_controller.rb

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "searches" SET "search" = ?, "updated_at" = ? WHERE "searches"."id" = ?  [["search", "1"], ["updated_at", 2017-07-12 23:41:47 UTC], ["id", 17]]
---
  def show
    render :layout => 'report'
    @principals = Principal.all
    @reports = MnpsReport.all
    @search = Search.find(params[:id])
    unless @search.model == "Prize"
    @model = @search.model.constantize
    @param = @search.select
      @results = @model.where("#{@param}": @search.search)
    if @param.include?("titlei") || @search.select.include?("sonicpartner") || @search.select.include?("appalachain")
    @results = @model.where("#{@param}": @search.search.to_b)
    elsif @param.instance_of?(String) && @search.model != "MnpsReport"
      if @search.search.include?(">")
        @gsearch = @search.search.tr(">","")
        @results = @model.where("#{@param} > ?", @gsearch.to_i)
        if @model.find_by("#{@param} > ?", @gsearch.to_i).present?
          @search.search = @model.first.id
          @param = "id"
          @search.save!

SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "0"]]
---
      @results = @model.where("#{@param}": @search.search)
      end
    elsif @search.model == "MnpsReport"
      @results = User.where(role: @search.search)

INSERT INTO "searches" ("model", "created_at", "updated_at") VALUES (?, ?, ?)  [["model", "Principal"], ["created_at", 2017-07-12 20:35:41 UTC], ["updated_at", 2017-07-12 20:35:41 UTC]]
SELECT "schools".* FROM "schools"
SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
---
  def create
    @search = Search.new(search_params)

    respond_to do |format|
      if @search.save
        format.html { redirect_to edit_search_path(@search), notice: 'Search was successfully created.' }
        format.json { render :show, status: :created, location: @search }
        format.js
      else
        format.html { render :new }
        format.json { render json: @search.errors, status: :unprocessable_entity }
      end
    end
    ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size}

UPDATE "searches" SET "select" = ?, "search" = ?, "updated_at" = ? WHERE "searches"."id" = ?  [["select", "peds"], ["search", ">10"], ["updated_at", 2017-07-12 23:41:47 UTC], ["id", 17]]
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def update
    respond_to do |format|
      if @search.update(search_params)
        if (@search.model == "MnpsReport" and not User.where(role: @search.search).nil?) || @search.model == "Prize"

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_search
      @search = Search.find(params[:id])