app/controllers/students_controller.rb

	def edit
    @student = Student.find(params[:id])
    @schools = School.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"

	def update
		@student = Student.find(params[:id])
    @call_log = CallLog.where(student_id: @student.id).last
    respond_to do |format|
      if @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "call_logs".* FROM "call_logs" WHERE "call_logs"."student_id" = ? ORDER BY "call_logs"."id" DESC LIMIT ?  [["student_id", 1], ["LIMIT", 1]]
UPDATE "students" SET "grade" = ?, "internet" = ?, "homelang" = ?, "school_id" = ?, "reffered_by" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["grade", 6], ["internet", true], ["homelang", "gfthf"], ["school_id", 8], ["reffered_by", "HH1234"], ["updated_at", 2017-07-19 20:07:00 UTC], ["id", 4]]