app/controllers/time_clocks_controller.rb

  def index
    @time_clocks = current_user.time_clocks
    @time_clock = TimeClock.new
    @test_clock = current_user.time_clocks.last
    unless @test_clock && @test_clock.clock_out.nil?
      @time = TimeClock.new(clock_in: DateTime.now, user_id: current_user.id, date: Date.today.to_s)
      @time.save!
    end
    @total_hours = 0
    @unpaid_hours = 0
    @time_clocks.each do |time|
      if time.clock_out.nil?
      else
        time.hours = time_diff(time.clock_in, time.clock_out).to_d
        time.save!
        @total_hours += time.hours
      end
    end
    @time_clocks.where(billed: false).each do |time|
---
SELECT  "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ? ORDER BY "time_clocks"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "time_clocks" ("date", "user_id", "created_at", "updated_at", "clock_in") VALUES (?, ?, ?, ?, ?)  [["date", Wed, 12 Jul 2017], ["user_id", 2], ["created_at", 2017-07-13 04:35:54 UTC], ["updated_at", 2017-07-13 04:35:54 UTC], ["clock_in", 2017-07-13 04:35:54 UTC]]
SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ?  [["user_id", 1]]
SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ? AND "time_clocks"."billed" = ?  [["user_id", 1], ["billed", false]]

  def create
    if (current_user.time_clocks.last && current_user.time_clocks.last.clock_out.nil?) &! current_user.administrator?
      redirect_to root_path
    elsif current_user.administrator?
      @time_clock = TimeClock.new(time_clock_params)
      @time_clock.date = Date.today
      @time_clock.save!
---
SELECT  "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ? ORDER BY "time_clocks"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "time_clocks" ("date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["date", Sun, 09 Jul 2017], ["user_id", 1], ["created_at", 2017-07-10 02:52:59 UTC], ["updated_at", 2017-07-10 02:52:59 UTC]]


    if current_user.mnps_teacher?
      @time_clock.clock_in = round_time(DateTime.now)
      @time_clock.save!
---
UPDATE "time_clocks" SET "updated_at" = ?, "clock_in" = ? WHERE "time_clocks"."id" = ?  [["updated_at", 2017-07-13 04:29:14 UTC], ["clock_in", 2017-07-13 23:29:14 UTC], ["id", 14]]

      end
    end
  end
  @users = User.all.joins(:time_clocks).where(time_clocks: {clock_out: nil}).count
     ActionCable.server.broadcast "online_channel",{users: @users}
     ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size}
---
SELECT COUNT(*) FROM "users" INNER JOIN "time_clocks" ON "time_clocks"."user_id" = "users"."id" WHERE "time_clocks"."clock_out" IS NULL
SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
SELECT COUNT(*) FROM "schools"

  def update
    @time_clock = TimeClock.find(params[:id])
    if current_user.hotline_teacher? || current_user.mnps_teacher?
      @time_clock.clock_out = round_time(DateTime.now)
      @time_clock.save!
---
SELECT  "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "time_clocks" SET "clock_out" = ?, "updated_at" = ?, "clock_in" = ? WHERE "time_clocks"."id" = ?  [["clock_out", 2017-07-13 23:40:00 UTC], ["updated_at", 2017-07-13 04:47:56 UTC], ["clock_in", 2017-07-13 10:40:00 UTC], ["id", 17]]

    def set_time_clock
      @time_clock = TimeClock.find(params[:id])
---
SELECT  "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]