app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ? ORDER BY date DESC  [["user_id", 1]]
SELECT "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ? AND "time_clocks"."billed" = ?  [["user_id", 1], ["billed", false]]
---
  def show
  	@user = User.find(params[:id])
  	@total_hours = 0
    @unpaid_hours = 0
    @time_clock = TimeClock.new
    @mnps_report = MnpsReport.new
  	@user.time_clocks.each do |time|
  		if time.hours.nil?
  		else
        @total_hours += time.hours
      end
    end
  @user.time_clocks.where(billed: false).each do |time|