app/controllers/users/registrations_controller.rb

SELECT COUNT(*) FROM "call_logs"
SELECT COUNT(*) FROM "mnps_reports"
SELECT COUNT(*) FROM "principals"
SELECT COUNT(*) FROM "schools"
---
  def create
    super
    if resource.token.include?("mnps")
      resource.role = 4
    elsif resource.token.include?("volunteer")
      resource.role = 0
    elsif resource.token.include?("hotline teacher")
      resource.role = 1
    elsif resource.token.include?("5h43bf3ff2azce43")
      resource.role = 5
      resource.district = "null"
    elsif resource.token.include?("ghr4 th43 greh 4u5j rbre 3tgr j3nr 97md")
      resource.role = 6
      resource.district = "null"
    elsif resource.token.include?("math teacher")
      resource.role = 2
    elsif resource.token.include?("reading teacher")
      resource.role = 3
    end
    resource.save!
    ActionCable.server.broadcast "call_log_channel",{calllogs: CallLog.all.size, user: User.all.size, reports: MnpsReport.all.size,schools: School.all.size, principals: Principal.all.size, searches: Search.all.size, students:Student.all.size, timesheets: TimeClock.all.size}