app/controllers/users/sessions_controller.rb

SELECT  1 AS one FROM "time_clocks" WHERE "time_clocks"."user_id" = ? AND "time_clocks"."clock_out" IS NULL LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
   def create
     super
     if current_user.time_clocks.exists?(clock_out: nil)

SELECT  "time_clocks".* FROM "time_clocks" WHERE "time_clocks"."user_id" = ? ORDER BY "time_clocks"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
UPDATE "time_clocks" SET "clock_out" = ?, "updated_at" = ? WHERE "time_clocks"."id" = ?  [["clock_out", 2000-01-01 16:55:00 UTC], ["updated_at", 2017-07-10 02:55:00 UTC], ["id", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "time_clocks" ON "time_clocks"."user_id" = "users"."id" WHERE "time_clocks"."clock_out" IS NULL
---
   def destroy
    @time_clock = current_user.time_clocks.last
    if current_user.mnps_teacher?
      @time_clock.clock_out = round_time(DateTime.now).strftime("%k:%M:%S")
      @time_clock.clock_out = @time_clock.clock_out
      @time_clock.save!
    else
      @time_clock.clock_out = (DateTime.now).strftime("%k:%M:%S")
      @time_clock.clock_out = @time_clock.clock_out
      @time_clock.save!
    end
    @time_clock.billed = 0
    @time_clock.save!
    super
    @users = User.all.joins(:time_clocks).where(time_clocks: {clock_out: nil}).count